
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 32 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_automation_account.automation_account
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;auto-pip-stg-courtel-api&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;courtel-certificate&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;gov-uk-notify-api-key&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;pip-team-email&#34;]
  * module.keyvault_apim_secrets.azurerm_key_vault_secret.secret[&#34;apim-subscription-key&#34;]
  * module.keyvault_apim_secrets.azurerm_key_vault_secret.secret[&#34;app-tenant-id&#34;]
  * module.keyvault_redis_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-HOST&#34;]
  * module.keyvault_redis_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-PASSWORD&#34;]
  * module.keyvault_redis_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-PORT&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-java-instrumentation-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-nodejs-instrumentation-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-tenant-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-ad-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-auth-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-config-admin-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-config-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-extension-app-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-tenant-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;cft-idam-client-secret&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;session-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-name&#34;]
  * module.kv.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_sdp.azurerm_monitor_diagnostic_setting.kv-ds
  * module.redis.azurerm_redis_cache.redis
* Replace
  * azurerm_key_vault_access_policy.app_mi_access_policy
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects_trigger_once


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.apim_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "apim_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "pip-apim-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "app_mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "pip-stg-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-stg-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa"
        name                          = "pip-ss-stg-aa"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (10 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/managed-identities-ptl-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-ptl-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-apim-stg-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-stg-mi",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_access_policy.app_mi_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "app_mi_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg/objectId/6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply)
      ~ object_id               = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.apim_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pip-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/ddfcadd8-5bc8-484e-9b94-8dce571ffa40" -> (known after apply)
      ~ job_schedule_id         = "ddfcadd8-5bc8-484e-9b94-8dce571ffa40" -> (known after apply)
      ~ parameters              = {
          - "application_id_collection" = "230bec9c-3991-4499-abe3-e58276a7dd99,c3c0f9b5-dfad-4d2b-8f20-4164db16900e"
          - "environment"               = "stg"
          - "key_vault_name"            = "pip-ss-kv-stg"
          - "prefix"                    = "auto"
          - "product"                   = "pip"
          - "source_client_id"          = "f4e06bc2-c8a5-4643-8ce7-85023024abb8"
          - "source_tenant_id"          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
          - "target_application_id"     = "0a68d82c-3643-4316-a8d8-f770a12ade1e"
          - "target_application_secret" = (sensitive value)
          - "target_tenant_id"          = "676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        } -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_job_schedule.client_serects_trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "client_serects_trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/jobSchedules/59f043ac-80d7-4dd7-9742-c2b1affe21d0" -> (known after apply)
      ~ job_schedule_id         = "59f043ac-80d7-4dd7-9742-c2b1affe21d0" -> (known after apply)
      ~ parameters              = {
          - "application_id_collection" = "230bec9c-3991-4499-abe3-e58276a7dd99,c3c0f9b5-dfad-4d2b-8f20-4164db16900e"
          - "environment"               = "stg"
          - "key_vault_name"            = "pip-ss-kv-stg"
          - "prefix"                    = "auto"
          - "product"                   = "pip"
          - "source_client_id"          = "f4e06bc2-c8a5-4643-8ce7-85023024abb8"
          - "source_tenant_id"          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
          - "target_application_id"     = "0a68d82c-3643-4316-a8d8-f770a12ade1e"
          - "target_application_secret" = (sensitive value)
          - "target_tenant_id"          = "676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        } -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule"
        name                    = "rotate-client-secrets-schedule"
      ~ start_time              = "2023-02-10T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_schedule.client_serects_trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "client_serects_trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/schedules/rotate-client-secrets-schedule-single-trigger"
        name                    = "rotate-client-secrets-schedule-single-trigger"
      ~ start_time              = "2023-02-09T11:34:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["auto-pip-stg-courtel-api"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/auto-pip-stg-courtel-api/243d2320e6a745e8afc2fd2039f0729f"
        name                    = "auto-pip-stg-courtel-api"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["courtel-certificate"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/courtel-certificate/488e716184b74444ba2804306b7322ed"
        name                    = "courtel-certificate"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["gov-uk-notify-api-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/gov-uk-notify-api-key/db5f4874515f464a87d8847335f40bb2"
        name                    = "gov-uk-notify-api-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_ado_secrets.azurerm_key_vault_secret.secret["pip-team-email"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/pip-team-email/bcdf208071594844b54d4a3a0d154fd6"
        name                    = "pip-team-email"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "bootstrap pip-bootstrap-stg-kv secrets"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_apim_secrets.azurerm_key_vault_secret.secret["apim-subscription-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-apim-kv-stg.vault.azure.net/secrets/apim-subscription-key/9dd7383fa5e84859b0ba09de2a1404e5"
        name                    = "apim-subscription-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "APIM"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_apim_secrets.azurerm_key_vault_secret.secret["app-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-apim-kv-stg.vault.azure.net/secrets/app-tenant-id/010d13fc42854dc5b551869c94d3f336"
        name                    = "app-tenant-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_redis_secrets.azurerm_key_vault_secret.secret["REDIS-HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/REDIS-HOST/c27e917eb10e421b9ac745fbe57d6ed8"
        name                    = "REDIS-HOST"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Redis"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_redis_secrets.azurerm_key_vault_secret.secret["REDIS-PASSWORD"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/REDIS-PASSWORD/aad5e321e9454fde8b094dcfa6dbf692"
        name                    = "REDIS-PASSWORD"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Redis"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_redis_secrets.azurerm_key_vault_secret.secret["REDIS-PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/REDIS-PORT/46a975c97feb4ef4a5a6c43e044599f6"
        name                    = "REDIS-PORT"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Redis"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-java-instrumentation-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-insights-java-instrumentation-key/d5ed46485fc24862ac8060acf4e5dda0"
        name                    = "app-insights-java-instrumentation-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "App Insights"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-nodejs-instrumentation-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-insights-nodejs-instrumentation-key/a5c761a9ef42455c9e1ce038fe0864df"
        name                    = "app-insights-nodejs-instrumentation-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "App Insights"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-tenant-id/6e75884757794cc5b6739353b7f0499a"
        name                    = "app-tenant-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-ad-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-ad-url/393424f8773241fe98a1be70736818b9"
        name                    = "b2c-ad-url"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-auth-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-auth-endpoint/5a11d3a5a21f4285962e13216c4bb605"
        name                    = "b2c-auth-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-config-admin-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-config-admin-endpoint/51386e906269465da6b4663bbc76a227"
        name                    = "b2c-config-admin-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-config-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-config-endpoint/4b8816cc89174ea5a5340362d401419e"
        name                    = "b2c-config-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-extension-app-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-extension-app-id/1f338cfb15a44dde8c9edceaf00405ae"
        name                    = "b2c-extension-app-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-tenant-id/0a88f286fefb4ecdb9134a323b7a55bc"
        name                    = "b2c-tenant-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-url/13887feb82b94246a9343877dacb52d6"
        name                    = "b2c-url"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["cft-idam-client-secret"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/cft-idam-client-secret/76d5fa70c6da4ffba3f4830dada411d7"
        name                    = "cft-idam-client-secret"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["session-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/session-key/df7555bb08ef46f1a0872686c26d4d37"
        name                    = "session-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "purpose"             = "b2c-session"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-connection-string"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-connection-string/f4c0b02ffdf84eeeb6ea24e78f2f40a4"
        name                    = "shared-storageaccount-connection-string"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-key/2a694c11a4814948bf6f093be1a08933"
        name                    = "shared-storageaccount-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-name"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-name/c47855dfbfdf4acbb028628fc6cd6cd5"
        name                    = "shared-storageaccount-name"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (6 unchanged attributes hidden)
    }

  # module.kv.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg|pip-ss-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg|pip-ss-apim-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-apim-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kv_sdp.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg|pip-ss-sdp-kv-stg"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "pip-ss-sdp-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-cache-stg/providers/Microsoft.Cache/Redis/pip-stg"
        name                          = "pip-stg"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved = 642 -> 300
          ~ maxmemory_delta                 = 642 -> 200
          ~ maxmemory_reserved              = 642 -> 200
            # (7 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 32 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":84,"Program":"tfcmt","SHA1":"","Vars":{}} -->